# 什么是类？
# 类是一种抽象数据类型，用于组织数据（属性）和操作（方法），用于创建具有相似特性的对象实例。类定义了对象的状态和行为，是构建复杂程序结构的基础。
# 即，顾名思义，“类"是一种类是对象的蓝图或模板，它定义了一类对象具有的属性和方法。

# 什么是编译器？
# 编译器：是一种计算机程序，它将源代码（如高级语言如Java、C++等）转换成机器语言（例如汇编语言或二进制代码）。这个过程称为编译。
# 即将源代码转化为计算机所能处理的二进制代码

# 什么是解释器？
# 解释器是在运行时逐行解析并执行代码的程序。它并不像编译器那样预先把整个程序转换成机器码，而是一行一行地读取源代码，理解其含义后直接执行。

# 解释封装、继承和多态。
# 封装：
# 它是一种数据隐藏的技术，通过将数据和操作这些数据的方法捆绑在一起形成一个独立的对象。

# 继承：
# 一种类可以继承另一种类的属性和方法，从而实现代码重用和扩展。被继承的类称为父类或基类，继承的类称为子类或派生类。（ 子类可以从父类继承属性和方法。）

# 多态：
# 同一接口（可以理解为“类”）的不同实例可以响应相同的调用，表现为多种形态。Python中的动态绑定允许我们在运行时确定实际调用哪个方法。
# 不同的类可以定义相同的方法，而在运行时可以根据对象的实际类型调用相应的方法。这允许不同类型的对象以统一的方式处理。
